{
    "version": "https://jsonfeed.org/version/1",
    "title": "Ayan Bhattacharjee",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Ph. D., Astrophysics.",
    "icon": "http://localhost:4000/AB-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    "items": [
    
      
        
        
        {
            "id": "http://localhost:4000/jet/physics/2024/11/14/On-FR-Dichotomy.html",
            "title": "How do FR-I Jets flare?",
            "content_text": "Radio galaxies are classified into two primary categories based on their morphology1: centerbrightened FR-I and edge-brightened FR-II. It is believed that the jet power and interactions with the ambient medium govern the deceleration and decollimation of the jet-spine flows, which, in turn, influence this dichotomy. Using high-resolution, three-dimensional relativistic hydrodynamic simulations, we follow the development of flow structures on sub-kpc to kpc scales in kinetically dominant low-power relativistic jets. We find that the bulk Lorentz factor of the jet spine and the advance speed of the jet head, which depend on the energy injection flux and the jet-to-background density contrast, primarily determine the dynamics and structures of the jet-induced flows. The entrainment of ambient gas and the background density and pressure gradient may also play significant roles. To emulate radio morphology, we produce the synthetic maps of the synchrotron surface brightness for the simulated jets, by employing simple models for magnetic field distribution and nonthermal electron population and considering relativistic beaming effects at different inclination angles. Both the flow structures and radio maps capture the longitudinal and transverse structures of the jet-spine and shear layer, consistent with observations. We also compare different background effects and argue that the loss of pressure confinement beyond the galactic core may be a key factor in the flaring and disruption of FR-I jets. Our results confirm that mildly relativistic jets could explain the one-sidedness or asymmetries with the boosted main jet and deboosted counterjet pairs.\n\nLink to the ApJ Paper\n\n\n  \n    \n      FR: Fanaroff-Riley, following the classification provided in FR74. &#8617;\n    \n  \n\n",
            "content_html": "<p>Radio galaxies are classified into two primary categories based on their morphology<sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\" rel=\"footnote\">1</a></sup>: centerbrightened FR-I and edge-brightened FR-II. It is believed that the jet power and interactions with the ambient medium govern the deceleration and decollimation of the jet-spine flows, which, in turn, influence this dichotomy. Using high-resolution, three-dimensional relativistic hydrodynamic simulations, we follow the development of flow structures on sub-kpc to kpc scales in kinetically dominant low-power relativistic jets. We find that the bulk Lorentz factor of the jet spine and the advance speed of the jet head, which depend on the energy injection flux and the jet-to-background density contrast, primarily determine the dynamics and structures of the jet-induced flows. The entrainment of ambient gas and the background density and pressure gradient may also play significant roles. To emulate radio morphology, we produce the synthetic maps of the synchrotron surface brightness for the simulated jets, by employing simple models for magnetic field distribution and nonthermal electron population and considering relativistic beaming effects at different inclination angles. Both the flow structures and radio maps capture the longitudinal and transverse structures of the jet-spine and shear layer, consistent with observations. We also compare different background effects and argue that the loss of pressure confinement beyond the galactic core may be a key factor in the flaring and disruption of FR-I jets. Our results confirm that mildly relativistic jets could explain the one-sidedness or asymmetries with the boosted main jet and deboosted counterjet pairs.</p>\n\n<p><a href=\"https://iopscience.iop.org/article/10.3847/1538-4357/ad83cc\">Link to the ApJ Paper</a></p>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\" role=\"doc-endnote\">\n      <p>FR: Fanaroff-Riley, following the classification provided in <a href=\"http://doi.org/10.1093/mnras/167.1.31P\">FR74</a>. <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
            "url": "http://localhost:4000/jet/physics/2024/11/14/On-FR-Dichotomy.html",
            "date_published": "2024-11-14T00:00:00+09:00",
            "date_modified": "2024-11-14T00:00:00+09:00",
            "author": {
                "name": "Ayan Bhattacharjee"
            }
        },
        
    
      
        
        
        {
            "id": "http://localhost:4000/accretion/physics/2018/10/02/generalized-flows-around-NS.html",
            "title": "Generalized Flows around Neutron Stars",
            "content_text": "In this chapter, we present a brief and non-exhaustive review of the developments of theoretical models for accretion flows around neutron stars. A somewhat chronological summary of crucial observations and modelling of timing and spectral properties are given in Sects. 2 and 3. In Sect. 4, we argue why and how the Two-Component Advective Flow (TCAF) solution can be applied to the cases of neutron stars when suitable modifications are made for the NSs. We showcase some of our findings from Monte Carlo1 and Smoothed Particle Hydrodynamic2 simulations which further strengthens the points raised in Sect. 4. In summary, we remark on the possibility of future works using TCAF for both weakly magnetic and magnetic Neutron Stars.\n\nLink to the Book Chapter\n\n\n  \n    \n      Monte Carlo simulations of thermal comptonization process in a two-component advective flow around a neutron star BC17. &#8617;\n    \n    \n      Timing Properties of Shocked Accretion Flows around Neutron Stars in the Presence of Cooling BC19 &#8617;\n    \n  \n\n",
            "content_html": "<p>In this chapter, we present a brief and non-exhaustive review of the developments of theoretical models for accretion flows around neutron stars. A somewhat chronological summary of crucial observations and modelling of timing and spectral properties are given in Sects. 2 and 3. In Sect. 4, we argue why and how the Two-Component Advective Flow (TCAF) solution can be applied to the cases of neutron stars when suitable modifications are made for the NSs. We showcase some of our findings from Monte Carlo<sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\" rel=\"footnote\">1</a></sup> and Smoothed Particle Hydrodynamic<sup id=\"fnref:2\" role=\"doc-noteref\"><a href=\"#fn:2\" class=\"footnote\" rel=\"footnote\">2</a></sup> simulations which further strengthens the points raised in Sect. 4. In summary, we remark on the possibility of future works using TCAF for both weakly magnetic and magnetic Neutron Stars.</p>\n\n<p><a href=\"https://link.springer.com/chapter/10.1007/978-3-319-94607-8_8\">Link to the Book Chapter</a></p>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\" role=\"doc-endnote\">\n      <p>Monte Carlo simulations of thermal comptonization process in a two-component advective flow around a neutron star <a href=\"https://ui.adsabs.harvard.edu/link_gateway/2017MNRAS.472.1361B/doi:10.1093/mnras/stx1867\">BC17</a>. <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\" role=\"doc-endnote\">\n      <p>Timing Properties of Shocked Accretion Flows around Neutron Stars in the Presence of Cooling <a href=\"https://ui.adsabs.harvard.edu/link_gateway/2019ApJ...873..119B/doi:10.3847/1538-4357/ab074a\">BC19</a> <a href=\"#fnref:2\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
            "url": "http://localhost:4000/accretion/physics/2018/10/02/generalized-flows-around-NS.html",
            "date_published": "2018-10-02T00:00:00+09:00",
            "date_modified": "2018-10-02T00:00:00+09:00",
            "author": {
                "name": "Ayan Bhattacharjee"
            }
        }
        
    
    ]
}